In [33]:
import pandas as pd

In [34]:
import numpy as np

In [52]:
df = pd.read_csv('/Users/sl/Downloads/my_df.csv', index_col=0)

In [53]:
df

          Quantity   Color  Price_per_kg
Apples          20     Red             3
Bananas         30  Yellow             2
Cherries        15     Red             4
Dates           10   Brown             5

In [54]:
df['Quantity'].sum()

75

In [55]:
print(df.nlargest(3, 'Price_per_kg'))

          Quantity  Color  Price_per_kg
Dates           10  Brown             5
Cherries        15    Red             4
Apples          20    Red             3

In [57]:
df.tail(2)

          Quantity  Color  Price_per_kg
Cherries        15    Red             4
Dates           10  Brown             5

In [58]:
df.describe()

        Quantity  Price_per_kg
count   4.000000      4.000000
mean   18.750000      3.500000
std     8.539126      1.290994
min    10.000000      2.000000
25%    13.750000      2.750000
50%    17.500000      3.500000
75%    22.500000      4.250000
max    30.000000      5.000000

In [59]:
df.loc['Bananas']

Quantity            30
Color           Yellow
Price_per_kg         2
Name: Bananas, dtype: object

In [60]:
df['Price_per_kg']*0.9

Apples      2.7
Bananas     1.8
Cherries    3.6
Dates       4.5
Name: Price_per_kg, dtype: float64

In [63]:
df.rename(columns={'Price_per_kg': 'ORIGINAL_PRICE'}, inplace = True)

In [64]:
df

          Quantity   Color  ORIGINAL_PRICE
Apples          20     Red               3
Bananas         30  Yellow               2
Cherries        15     Red               4
Dates           10   Brown               5

In [65]:
df.drop('Color', axis = 1, inplace = True)

In [66]:
df

          Quantity  ORIGINAL_PRICE
Apples          20               3
Bananas         30               2
Cherries        15               4
Dates           10               5